{"authors": ["Staff Writer"], "publish_date": "nil", "text": "Health minister Dr Zweli Mkhize has announced that there are now 2,783 confirmed cases of coronavirus in South Africa – a significant increase of 178 cases from Thursday.\n\nOn Thursday, there were 2,605 cases.\n\nSouth Africa’s testing has hit over the 100,000 mark, with 100,827 tests now conducted.\n\nThe minister also reported two additional deaths, taking the country’s total to 50.\n\nGauteng has also passed 1,000 cases (1,018), remaining the hardest hit province in the country.\n\nAs at today, the total number of confirmed #COVID_19 cases in South Africa is 2783. pic.twitter.com/cBQs3KgvSo — Dr Zweli Mkhize (@DrZweliMkhize) April 17, 2020\n\nGlobally, coronavirus cases closed in on 2.2 million infections, with deaths climbing to 147,512, along with more than 557,000 recoveries.\n\nThe Trump administration issued guidelines that could allow states and employers to abandon most social distancing practices within a month, Bloomberg reported.\n\nChina’s GDP meanwhile showed the first contraction in decades after the outbreak shut down large parts of the world’s second-biggest economy. The country revised its death toll by 39%, adding more than 1,000 fatalities in Wuhan, where the epidemic first emerged.\n\nThe latest revision of the coronavirus death toll by authorities in the central Chinese city of Wuhan “can stand the test of history,” foreign ministry spokesman Zhao Lijian told a briefing on Friday.\n\nAuthorities released the revised data at the first available opportunity, Zhao said.\n\nChina revised its total death toll from the coronavirus to 4,632 from 3,342 after adding about 1,290 fatalities in Wuhan, the city where the virus first emerged last December, according to a statement from the country’s National Health Commission.\n\nThe revision in numbers was due to several reasons, said the report. The first is that some patients died at home without seeing a doctor or being tested for the virus as hospitals were overwhelmed during the epidemic’s peak.\n\nLate and incomplete reporting due to medical workers and institutions being overwhelmed by the epidemic were also cited. Zhao said revisions are common international practice, adding that there has never been any cover-up of the outbreak.\n\nRussia meanwhile, reported another record daily increase in new infections. Cases also increased in Germany at a faster rate, while Singapore reported its biggest jump in infections after an outbreak at dormitories, Bloomberg reported.\n\nExtend extended lockdown in SA\n\nPeter Attard Montalto of Intellidex, a capital markets and financial services research house, said that there has been some promise that further relaxations will occur in the coming weeks in South Africa, “but we are yet to see a proper risk adjusted approach with any business able to resume if it can show appropriate health protocols”.\n\n“The government’s command and control mindset is still hampering the transition to this mode,” he said.\n\nAttard Montalto said that the government’s message is conflicting, with talk about lockdown ending, but then also saying it could be extended.\n\n“We do expect government to eventually switch to this risk adjusted mindset and that after that we enter a new phase which may well have to last till start September at least when DoH (Department of Health) currently see the number of cases peaking at the end of winter,” he said.\n\nCrucially for the average South African, Attard Montalto said that a generalised ban on movement however, is likely to be extended from the end April, though allowing more firms to work with health protocols.\n\n“That said the alternative scenario is that we see the lockdown end to some degree in May, but then have to be put back in place through end June and into July as case and death numbers accelerate fastest in mid-winter. Both scenarios are broadly the same in terms of economic impact,” he said.\n\nJob losses\n\nThe net result for the country’s growth prospects is clearly negative, with Attard Montalto forecasting -9.7% GDP growth for this year, 4.5% for 2021 and 2.5% for 2021.\n\n“We see around 1.5 million jobs lost currently with this forecast though the number at risk is much higher, the forecast includes the furlough ability allowed by UIF policies,” he said.\n\n“Note we still strongly hint that the impact here will last longer and there will be further extensions. We also think about a scenario of a phased risk adjusted approach lasting till start September which could see growth of around -15.5% this year.\n\n“This however would see major job losses of over 2 million people and so we get into a circle problem of the scenario becoming impossible to implement,” the analyst said.\n\nCabinet said in a statement on Thursday that all clusters have been asked to work together to produce one consolidated document on key priorities of the country’s economic recovery plan, to be completed before the next cabinet meeting scheduled to take place on Monday, 20 April 2020.\n\nRead: South African medical aids asked to give members a 3 month premium holiday – and cover coronavirus tests", "keywords": ["cases", "south", "death", "confirmed", "2783", "zhao", "50", "africa", "risk", "end", "countrys", "deaths", "health", "coronavirus", "montalto"], "summary": "Health minister Dr Zweli Mkhize has announced that there are now 2,783 confirmed cases of coronavirus in South Africa – a significant increase of 178 cases from Thursday.\nThe minister also reported two additional deaths, taking the country’s total to 50.\nGauteng has also passed 1,000 cases (1,018), remaining the hardest hit province in the country.\nAs at today, the total number of confirmed #COVID_19 cases in South Africa is 2783. pic.twitter.com/cBQs3KgvSo — Dr Zweli Mkhize (@DrZweliMkhize) April 17, 2020Globally, coronavirus cases closed in on 2.2 million infections, with deaths climbing to 147,512, along with more than 557,000 recoveries.\nRead: South African medical aids asked to give members a 3 month premium holiday – and cover coronavirus tests", "url": "https://businesstech.co.za/news/government/390543/2783-confirmed-coronavirus-cases-in-south-africa-with-deaths-up-to-50/", "rss_link": "http://businesstech.co.za/news/feed/", "title": "2,783 confirmed coronavirus cases in South Africa – with deaths up to 50"}
{"authors": ["Staff Writer"], "publish_date": "nil", "text": "New research from consumer credit reporting agency, TransUnion finds that eight in 10 South Africans say their household income has been negatively impacted by the Covid-19 pandemic.\n\nTransUnion has initiated a survey of adults (18 years old and over) in South Africa and abroad to better understand the financial impact of Covid-19 on consumers.\n\nThe initial survey of 2,001 adults found that some generations, particularly Millennials (those born 1980 to 1994) and Gen X (born 1965 to 1979), have been harder hit financially by the Covid-19 pandemic.\n\nConcern over ability to pay bills was highest among Millennials (92%) and Gen X (95%).\n\nOf consumers who are concerned about paying their bills, 46% report that they will not be able to pay their utilities (electricity, water, etc.), 42% will not be able to make their rent repayment and 39% report that they will not be able to pay their cell phone bill.\n\nTwo in five (40%) people financially impacted by the pandemic said they had already reached out to companies they have accounts with to discuss payment options.\n\nIn response to the financial challenges caused by Covid-19, 29% of South African consumers said they planned to use their savings to pay current bills.\n\nA smaller number (22%) said they would borrow money from a friend or family member.\n\nAdditionally, 27% of impacted consumers do not know how they are going to pay their bills or loans and 33% will only pay a partial amount that they can afford.\n\nRead: Survey shows that South Africans are already losing their jobs during lockdown", "keywords": ["doing", "lockdown", "south", "pay", "report", "x", "able", "africans", "consumers", "impacted", "bills", "covid19", "financially", "survey"], "summary": "New research from consumer credit reporting agency, TransUnion finds that eight in 10 South Africans say their household income has been negatively impacted by the Covid-19 pandemic.\nTransUnion has initiated a survey of adults (18 years old and over) in South Africa and abroad to better understand the financial impact of Covid-19 on consumers.\nConcern over ability to pay bills was highest among Millennials (92%) and Gen X (95%).\nIn response to the financial challenges caused by Covid-19, 29% of South African consumers said they planned to use their savings to pay current bills.\nRead: Survey shows that South Africans are already losing their jobs during lockdown", "url": "https://businesstech.co.za/news/banking/390341/what-south-africans-are-doing-to-get-through-lockdown-financially/", "rss_link": "http://businesstech.co.za/news/feed/", "title": "What South Africans are doing to get through lockdown, financially"}
{"authors": ["Staff Writer"], "publish_date": "nil", "text": "Parliament’s Portfolio Committee on Higher Education will hold a virtual meeting on Tuesday (21 April) to assess the impact of the lockdown on the higher education sector.\n\nAs part of the briefing, minister of Higher Education, Science and Technology, Dr Blade Nzimande will present plans from the department, universities and Technical Vocational Education and Training (TVET) colleges to rescue the 2020 academic year.\n\nIssues which are expected to be covered in the Higher Education plan include:\n\nPlans to rescue the academic year for both universities & TVET colleges;\n\nOnline learning and teaching, what is to be done with mid-term examinations;\n\nThe impact of the lockdown on National Student Financial Aid Scheme (Nsfas) qualifying students;\n\nThe accommodation of students at university residences.\n\n“It is important that as a country we do everything in our power to save the 2020 academic year in the Post School Education and Training sector,” said committee chairperson Philly Mapulane\n\n“The future of our country is dependent on the continuous production of graduates from this sector for the economy and for all other sectors in our society,” he said.\n\nThe majority of the country’s schools and universities were closed due to social distancing measures even before the country’s five-week lockdown came into effect.\n\nAs a result, they have had the difficult balancing act of continuing to offer courses while ensuring the standard of education does not drop.\n\nA number of the country’s universities have already indicated that they will continue with online courses for the rest of the semester.\n\nThe University of Cape Town has proposed moving to a model of ‘continuous assessment’ and has decided to suspend invigilated examinations for courses during the first semester.\n\nThe university is also proposing during the 2020 academic year there will also be no academic exclusions.\n\nWits University said that it would effectively ‘reopen‘ online as of Monday (20 April), as it prepares for its second block of teaching.\n\nHowever, it indicated that not all courses would be available due to inherent limitations. There are specific disciplines that may be patient-based, laboratory-based, studio-based or involve creative practices that cannot be undertaken online, it said.\n\n“To be clear, the university is not transitioning to a permanent online modality for all courses, nor are we becoming a correspondence institution,” it said.\n\n“We are instituting an emergency remote teaching and learning programme as one measure that will help us to minimise the time lost in the academic project.”\n\nRead: Extending the extended lockdown in South Africa: don’t expect freedom of movement in May", "keywords": ["universities", "rescue", "courses", "south", "african", "lockdown", "2020", "university", "education", "working", "countrys", "academic", "plan", "online", "higher"], "summary": "Parliament’s Portfolio Committee on Higher Education will hold a virtual meeting on Tuesday (21 April) to assess the impact of the lockdown on the higher education sector.\nAs part of the briefing, minister of Higher Education, Science and Technology, Dr Blade Nzimande will present plans from the department, universities and Technical Vocational Education and Training (TVET) colleges to rescue the 2020 academic year.\nThe majority of the country’s schools and universities were closed due to social distancing measures even before the country’s five-week lockdown came into effect.\nA number of the country’s universities have already indicated that they will continue with online courses for the rest of the semester.\nThe university is also proposing during the 2020 academic year there will also be no academic exclusions.", "url": "https://businesstech.co.za/news/government/390551/government-working-on-new-plan-to-rescue-the-academic-year-for-south-african-universities/", "rss_link": "http://businesstech.co.za/news/feed/", "title": "Government working on new plan to rescue the academic year for South African universities"}
{"authors": ["Staff Writer"], "publish_date": "nil", "text": "In an effort to curb the effect of Covid-19 on businesses and economies, governments across the globe have undertaken to adopt and amend various pieces of legislation which offer financial and social support.\n\n“As yet, South Africa has not followed suit from an insolvency and business rescue perspective,” said law firm Cliffe Dekker Hofmeyr. “The question is, to what extent can we expect similar policy changes going forward?”\n\nBelow the firms looked at some of the policies introduced by other countries, and how they stack up to South Africa.\n\nThe United States\n\nWith the World Health Organisation warning that the US has the potential to become the new epicentre of the Covid-19 pandemic, there have been some noteworthy policy changes adopted in different states and jurisdictions in an effort to alleviate the effects of the Covid-19 pandemic.\n\nThe CARES Act (Coronavirus Aid, Relief and Economic Security) has been adopted in the US to support both businesses and individuals through government funding schemes.\n\nThe CARES Act has provided for relief in many areas including:\n\nPaycheque Protection, allowing for eligible businesses to maintain their payroll and certain overhead expenses through the period of emergency; and\n\nAllowing the deferral of employer taxes for 2020, with 50% of payroll tax payments for 2020 being due in 2021 and the remaining 50% being due in 2022.\n\nOther policy changes include:\n\nThe Federal Reserve (Fed) has reduced interest rates to essentially zero. The rate of emergency lending at the discount window for banks has been reduced by 125 basis points to 0.25% and the term of loans lengthened to 90 days;\n\nThe Fed also cut the reserve requirements for many banks to zero; and\n\nThere have been many Loan Mortgage Corporations that have implemented a 60-day suspension of foreclosures/evictions and plans to reduce/suspend mortgage payments for up to twelve months for those affected by Covid-19.\n\nThe UK\n\nThe UK has adopted a series of temporary measures to combat the disruption caused by Covid-19. These include:\n\nThe Monetary Policy Committee voted to cut bank rates to 0.1%;\n\nSubject to eligibility, an allowance for a three-month VAT payment deferment has been adopted;\n\nBusiness rates holidays for retail, hospitality and leisure businesses have been extended for the 2020 and 2021 tax year;\n\nThe Coronavirus Business Interruption Loan Scheme has been temporarily introduced in order to provide loans, overdraft facilities and other financing options to SMEs;\n\nThe Bank of England will, under the new Covid-19 Financing Facility, buy short term debt from larger companies, allowing companies to finance short term liabilities;\n\nUnder the new Coronavirus Bill, commercial tenants unable to pay their rent due to Covid-19 will be temporarily protected from eviction; and\n\nThe Prudential Regulatory authority set out supervisory expectations that banks should not increase dividends or other distributions in response to policy actions.\n\nAustralia\n\nOn 22 March 2020, Australian Treasurer Joshua Frydenberg announced amendments to the Corporations Act 2001 to provide temporary relief for financially distressed businesses caused by Covid-19.\n\nAs a result, the Coronavirus Economic Response Package Omnibus Act (CERPO Act) was passed by Parliament on 23 March 2020.\n\nThe amendments introduced by the CERPO Act will apply for a six-month period but may be extended or have effects beyond this timeline. The CERPO Act introduces the following amendments:\n\nAn insolvent trading safe harbour, constituting a 6-month moratorium on insolvent trading liability for directors in respect of debts incurred “in the ordinary course of the company’s business”;\n\nThe current minimum threshold for creditors to issue a statutory demand on a company has also been increased from AU$2,000 to AU$20,000 for the next six months;\n\nCompanies will have six months to respond to a statutory demand. This is an increase from the previous 21-day timeframe which is a precursor to winding up proceedings being commenced by creditors; and\n\nThe Treasurer has been given instrument-making power to amend provisions of the Corporations Act 2001 to provide relief from, or modify, obligations under that Act.\n\nSpain\n\nFollowing the declaration of a state of emergency on 14 March 2020, the Spanish government introduced several Royal Decree-Laws (RDLs) to mitigate the impact of Covid-19.\n\nThe RDLs make the following amendments to bankruptcy and insolvency proceedings:\n\nA three-month moratorium on mortgage payments for habitual residence for borrowers experiencing difficulties in making mortgage payments as a result of Covid-19. This moratorium has also been extended to:\n\n(i) individuals who are professionals or entrepreneurs as it pertains to their professional/ business premises; and\n\n(ii) mortgages for the acquisition by individuals of housing to be rented when the owner ceases to receive the rent as a result of Covid-19.\n\nDuring the moratorium, lenders cannot demand mortgage payments or any repayments of principal or interest and no interest or late payment interest will accrue;\n\nA three-month moratorium on repayments for consumer credit and other non-mortgage loans for individuals experiencing difficulties in making payments as a result of Covid-19, with no interest or late payment interest accruing;\n\nCreditors’ petitions for compulsory liquidation will not be allowed until two months have passed after the state of emergency has ended, and debtors’ own filings will be given priority even if submitted later; and\n\nWhile the state of emergency is in effect, debtors are not required to file for insolvency proceedings (within two months of insolvency), even where they applied for protection from creditors under Spanish insolvency law and the stipulated negotiation period has elapsed.\n\nSouth Africa\n\nMuch like the nations mentioned above, South Africa has embarked on several policy amendments to not only combat the spread of the virus, but also to protect business and individuals from its devastating economic effect, said Cliffe Dekker Hofmeyr.\n\nThe most noteworthy legislative measures taken by the South African government thus far are as follows:\n\nThe Department of Trade, Industry and Competition (DTIC) published regulations in terms of the Competition Act whereby the retail property sector has been exempt from Chapter 2, more specifically, sections 4 and 5 of the Competition Act, which sections ordinarily prohibit entities in horizontal and vertical relationships from entering into agreements or engaging in practices which prevent or lessen competition in the market/\n\nUnder the regulations, retail tenants and retail property landlords may conclude agreements allowing for rental payment holidays, rental discounts, limitations on the eviction of tenants and the suspension of or adjustment to lease agreement clauses which are restrictive to the retail tenant from undertaking reasonable measures required to protect viability during the national disaster.\n\nSimilar block exemptions have been issued to the healthcare and banking sectors as well as the hotel industry.\n\nThe DTIC has also introduced the Consumer and Customer Protection and National Disaster Management Regulations and Directions under the auspices of the Competition Act and the Consumer Protection Act. The aim of these regulations is to protect consumers from unfair, unreasonable, improper or unjust commercial practices in response to a surge in demand during the National Disaster.\n\nIt should be noted that government has also introduced a number of employee and sector-specific financial relief schemes, including:\n\nThe Temporary Employee/Temporary Employer Scheme (TERS);\n\nThe Business Growth and Resilience Facility will provide working capital, stock, bridging finance, order finance and equipment finance to small businesses which supply in-demand medical supplies like hand sanitiser, with funding dependent on the business’s requirements;\n\nThe SMME Relief Finance Facility will provide soft-loan funding for existing businesses which are distressed due to the effects of the Covid-19 pandemic. The aid will be available for six months from 1 April 2020, although businesses may apply for a longer period of assistance if additional assistance is required;\n\nThe SEFA-Debt Restructuring Facility is geared towards SMMEs which are already funded by the Small Enterprise Funding Agency (SEFA) and are negatively affected by the Covid-19 outbreak. SEFA will grant a payment holiday for up to six months;\n\nThe Industrial Development Corporation has put a package of more than R3 billion together for industrial funding to address the situation of vulnerable firms and to fast-track financing for companies critical to efforts to fight Covid-19 and its economic impact;\n\nR200 million in aid has been made available by the Department of Tourism to assist SMMEs in the tourism and hospitality sector who are under particular stress due to the travel restrictions;\n\nA number of business-backed funds as well as payment holidays being offered by the country’s banks. However, it should be noted that these are not government-mandated.\n\nRead: 9 things every South African should know about government’s financial relief scheme and their job", "keywords": ["south", "2020", "payments", "introduced", "act", "africa", "relief", "businesses", "payment", "policy", "policies", "world", "covid19", "interest", "compares", "coronavirus"], "summary": "“As yet, South Africa has not followed suit from an insolvency and business rescue perspective,” said law firm Cliffe Dekker Hofmeyr.\n“The question is, to what extent can we expect similar policy changes going forward?”Below the firms looked at some of the policies introduced by other countries, and how they stack up to South Africa.\nThe CARES Act (Coronavirus Aid, Relief and Economic Security) has been adopted in the US to support both businesses and individuals through government funding schemes.\nAs a result, the Coronavirus Economic Response Package Omnibus Act (CERPO Act) was passed by Parliament on 23 March 2020.\nRead: 9 things every South African should know about government’s financial relief scheme and their job", "url": "https://businesstech.co.za/news/government/390507/coronavirus-policies-around-the-world-and-how-south-africa-compares/", "rss_link": "http://businesstech.co.za/news/feed/", "title": "Coronavirus policies around the world – and how South Africa compares"}
{"authors": ["Staff Writer"], "publish_date": "nil", "text": "Don’t expect freedom of movement once the extended lockdown period has ended in South Africa.\n\nThe country has entered phase two of the lockdown period, which is expected to last for two weeks, through to the end of April, and under changed regulations, as announced by the government on Thursday (16 April).\n\n“Today, we’re not coming with many new regulations. We’re extending the regulations that exist because the lockdown was extended,” said Cooperative Governance and Traditional Affairs (Cogta) minister, Dr Nkosazana Dlamini-Zuma, in an address to the nation.\n\n“When we do stop the lockdown, we can’t do it abruptly. We have to phase it in so that there’s an orderly move towards what would be normality,” said Dlamini-Zuma.\n\nShe, however, stressed that precautionary measures will remain beyond the lockdown to safeguard the health of the nation.\n\n“It doesn’t mean that after the lockdown, everything will go back to normal.”\n\nMixed messages\n\nPeter Attard Montalto of Intellidex, a capital markets and financial services research house, said that there has been some promise that further relaxations will occur in the coming weeks, “but we are yet to see a proper risk adjusted approach with any business able to resume if it can show appropriate health protocols”.\n\n“The government’s command and control mindset is still hampering the transition to this mode,” he said.\n\nAttard Montalto said that the government’s message is conflicting, with talk about lockdown ending, but then also saying it could be extended.\n\n“We do expect government to eventually switch to this risk adjusted mindset and that after that we enter a new phase which may well have to last till start September at least when DoH (Department of Health) currently see the number of cases peaking at the end of winter,” he said.\n\nCrucially for the average South African, Attard Montalto said that a generalised ban on movement however, is likely to be extended from the end April, though allowing more firms to work with health protocols.\n\n“That said the alternative scenario is that we see the lockdown end to some degree in May, but then have to be put back in place through end June and into July as case and death numbers accelerate fastest in mid-winter. Both scenarios are broadly the same in terms of economic impact,” he said.\n\nThe net result for the country’s growth prospects is clearly negative, with Attard Montalto forecasting -9.7% GDP growth for this year, 4.5% for 2021 and 2.5% for 2021.\n\n“We see around 1.5 million jobs lost currently with this forecast though the number at risk is much higher, the forecast includes the furlough ability allowed by UIF policies,” he said.\n\n“Note we still strongly hint that the impact here will last longer and there will be further extensions. We also think about a scenario of a phased risk adjusted approach lasting till start September which could see growth of around -15.5% this year.\n\n“This however would see major job losses of over 2 million people and so we get into a circle problem of the scenario becoming impossible to implement,” the analyst said.\n\nCabinet said in a statement on Thursday that all clusters have been asked to work together to produce one consolidated document on key priorities of the country’s economic recovery plan, to be completed before the next cabinet meeting scheduled to take place on Monday, 20 April 2020.\n\nSocial unrest\n\nIt’s not only the economy at stake. South African society is also at risk if the government extends a five-week lockdown without allowing more industries to get back to work, said Investec Group chief executive officer Fani Titi, and the head of the company’s South African banking unit, Richard Wainwright.\n\n“We don’t have the capacity to absorb the kind of job losses that could result,” Titi said via a video conference call, as reported by Bloomberg. “We would see significant damage to the economy, but also to the social fabric.”\n\n“They’re going to have to select types of businesses and industries where it is practical to start lifting the lockdown restrictions,” said Wainwright. “But at the same time protecting people whether it is through social distancing or screening technology.”\n\nPolitical analyst Daniel Silke also warned that the extended lockdown will test the limits of South Africans’ tolerance to be unnaturally isolated, noting that even within the first three weeks there was a marked increase in looting and unrest.\n\nWhile most of society, including businesses and opposition parties and citizens in general stood in solidarity with the move – during the extended period, these ties will fray and start to come undone.\n\nPolitical parties, who have been generally locked out of the response to the Covid-19 crisis up until now, will start speaking out and calling for (their alternatives), businesses will struggle further, and criminal elements will take full advantage, Silke said.\n\n“Five weeks of lockdown are likely to stretch the tolerance of citizens who are unnaturally confined to their homes and prevented from more regular activities.\n\n“Already, we have seen liquor stores looted, illicit tobacco dealings back in action and abandoned schools vandalised. Crime therefore is mutating as the lockdown creates new avenues for offences,” Silke said.\n\n“Thus far, South Africa has managed a commendable show of unity of purpose. But don’t expect this to last forever. ”\n\nRead: You will now need this new certificate to stay open as an essential service during South Africa’s lockdown", "keywords": ["weeks", "extending", "lockdown", "south", "freedom", "expect", "start", "movement", "africa", "work", "risk", "end", "dont", "extended", "health", "montalto"], "summary": "Don’t expect freedom of movement once the extended lockdown period has ended in South Africa.\nWe’re extending the regulations that exist because the lockdown was extended,” said Cooperative Governance and Traditional Affairs (Cogta) minister, Dr Nkosazana Dlamini-Zuma, in an address to the nation.\nShe, however, stressed that precautionary measures will remain beyond the lockdown to safeguard the health of the nation.\nAttard Montalto said that the government’s message is conflicting, with talk about lockdown ending, but then also saying it could be extended.\n”Read: You will now need this new certificate to stay open as an essential service during South Africa’s lockdown", "url": "https://businesstech.co.za/news/business/390493/extending-the-extended-lockdown-in-south-africa-dont-expect-freedom-of-movement-in-may/", "rss_link": "http://businesstech.co.za/news/feed/", "title": "Extending the extended lockdown in South Africa: don’t expect freedom of movement in May"}
{"authors": ["Staff Writer"], "publish_date": "nil", "text": "The Discovery Health Medical Scheme is offering ‘isolation hotels’ to help members infected with the coronavirus to recover in solitude.\n\nThe scheme said that most people with Covid-19 are expected to experience mild illness and can recover at home. However, because Covid-19 is highly contagious, complete isolation is necessary to avoid putting family members at risk of contracting the disease, it said.\n\n“To give members diagnosed with Covid-19 the option of isolating away from home, Discovery has partnered with hotel providers to create specifically managed isolation facilities.\n\n“The first hotel group offering this service is The Capital Hotels and Apartments. This benefit assists members of Discovery Medical Health Scheme (DHMS) who have Covid-19 to self-isolate in one of these dedicated isolation facilities.”\n\nDiscovery said that members will get a significantly reduced rate of about 60% off the daily rate when staying at these hotels as an alternative to home-based isolation.\n\nMembers will also have access to tailored medical support including nursing care, supportive over-the-counter medicine and online doctor consultations, as required, it said.\n\n“Discovery Health Medical Scheme will make 24-hour nursing care available at the hotel,” it said.\n\n“Nurses are registered with Discovery Home Care and will provide telephonic consultation and supportive over-the-counter medicine when needed.\n\n“While this option is mainly for someone with mild to no symptoms of Covid-19, nurses will also make referrals for online doctor consultations or medical transport to nearby hospitals.\n\n“The scheme will fund online doctor consultations and medicine from day-to-day benefits where available and the DHMS WHO Global Outbreak Benefit as specified on the benefit letter.”\n\nBelow the group outlined how members will qualify to stay in one of these hotels. Discovery said that members can access this benefit while waiting for their Covid-19 test results (two days) or after a confirmed diagnosis of Covid-19.\n\nWhen you have been diagnosed with Covid-19 (positive test results)\n\nYou will receive a letter that gives details of your cover from the DHMS WHO Global Outbreak Benefit. If you have not received the benefit letter, you can phone Discovery Health Medical Scheme on 0860 99 88 77 to confirm the COVID-19 diagnosis and to send the letter confirming your cover from the DHMS WHO Global Outbreak Benefit.\n\nPhone the hotel to confirm their rates and to book. Quote the authorisation number you received from the Scheme.\n\nPresent the authorisation letter (print or electronic) when you check in and pay the reduced rate directly to the hotel for the period that you will be staying in isolation.\n\nWhen you are waiting for Covid-19 test results\n\nIf your doctor suspects that you have COVID-19 and you are waiting for test results, you are eligible for this reduced rate at one of the hotels for two days.\n\nPhone Discovery Health Medical Scheme on 0860 99 88 77 to get an authorisation number for the two-day stay at the hotel.\n\nPhone the hotel to confirm their rates and to book. Quote the authorisation number you received from the Scheme.\n\nPresent the authorisation number when you check in and pay the reduced rate directly to the hotel. You will be required to pay for 14 days in advance during check-in.\n\n“When you get a negative test result for Covid-19, the reduced rate will no longer apply and you will receive a refund of the payment you made for the additional days,” said Discovery.\n\n“With a test result confirming that you have Covid-19, the authorisation for isolation at the hotel will be extended as part of the DHMS WHO Global Outbreak Benefit.”\n\nRead: South African medical aids asked to give members a 3 month premium holiday – and cover coronavirus tests", "keywords": ["hotels", "test", "authorisation", "lockdown", "south", "rate", "heres", "benefit", "medical", "scheme", "africans", "work", "hotel", "isolation", "members", "covid19", "offers", "discovery"], "summary": "The Discovery Health Medical Scheme is offering ‘isolation hotels’ to help members infected with the coronavirus to recover in solitude.\n“To give members diagnosed with Covid-19 the option of isolating away from home, Discovery has partnered with hotel providers to create specifically managed isolation facilities.\n“Discovery Health Medical Scheme will make 24-hour nursing care available at the hotel,” it said.\nDiscovery said that members can access this benefit while waiting for their Covid-19 test results (two days) or after a confirmed diagnosis of Covid-19.\nPhone Discovery Health Medical Scheme on 0860 99 88 77 to get an authorisation number for the two-day stay at the hotel.", "url": "https://businesstech.co.za/news/lifestyle/390471/discovery-now-offers-isolation-hotels-for-south-africans-during-the-lockdown-heres-how-they-work/", "rss_link": "http://businesstech.co.za/news/feed/", "title": "Discovery now offers ‘isolation hotels’ for South Africans during the lockdown – here’s how they work"}
{"authors": ["Staff Writer"], "publish_date": "nil", "text": "South Africans businesses continue to bear the brunt of an extended lockdown and are concerned that the latest regulations are insufficient for the resumption of safe operations and public well-being, says business body, Sakeliga.\n\nThe group said it conducted a poll of 400 companies after the latest lockdown regulations were announced on Thursday (16 April).\n\nThe poll showed that three quarters of businesses indicated that they now expect their 2020 turnover to drop by more than 25%. In addition, 40% indicated that they do not see a way of recuperating their losses.\n\nOf the businesses that qualified as “essential”, 83% indicated that they experience increased difficulty in obtaining inputs from upstream providers, with 55% indicating severe difficulty.\n\nOne of the biggest points of contention is around what businesses are declared ‘essential’, with Sakeliga arguing that prohibitions on services such as community neighbourhood watches, regular informal food trading, and e-trade are ‘patently harmful’.\n\n“The current distinction between essential and non-essential businesses is only one of many ways in which to deal with public health risk,” said Piet le Roux, chief executive officer at Sakeliga.\n\n“While intuitive from a policy perspective, its practical effects are now clear: to try and define what is essential and not is to create a maze of uncertainty and delays, which brings its own public health consequences.”\n\n“Currently, virtually every business activity that is not specifically allowed is prohibited.”\n\nWhile Sakeliga noted that there is no lack of goodwill from businesses to voluntarily comply with requests and guidelines, there are concerns that companies are faced with an ever-changing, unclear and semi-permanent regulatory framework for the economy.\n\n“It is a mountain that especially small and medium-sized business will not be able to climb,” said le Roux.\n\n“It will obstruct thousands of businesses whose operations pose no additional health risk with prohibitions, paperwork requirements, and policy-lags.”\n\nAlternative\n\nInstead of following the current essential vs non-essential business model, government should look at allowing companies to operate based on a risk-assessment, le Roux said.\n\nGovernment could then effectively focus on companies that are seen as ‘high-risk’ vs companies that are seen as ‘low-risk’, he said.\n\n“All businesses could continue as long as they make sure that their operations are adjusted for health risks.\n\n“Regulators then focus on identifying and defining risky operations which need to be changed, instead of identifying businesses that should be open or closed.”\n\nSakeliga said that the attractiveness of this approach is that it could boost both public health and social and economic stability.\n\n“It would also be much easier to understand and support, because the regulatory focus falls on defining what is not allowed, instead of defining what is allowed – as the case should be in a free society,” said le Roux.\n\nRead: You will now need this new certificate to stay open as an essential service during South Africa’s lockdown", "keywords": ["vs", "nonessential", "business", "south", "essential", "african", "public", "heres", "say", "le", "lockdown", "companies", "indicated", "instead", "operations", "working", "businesses", "health"], "summary": "The group said it conducted a poll of 400 companies after the latest lockdown regulations were announced on Thursday (16 April).\nThe poll showed that three quarters of businesses indicated that they now expect their 2020 turnover to drop by more than 25%.\nOf the businesses that qualified as “essential”, 83% indicated that they experience increased difficulty in obtaining inputs from upstream providers, with 55% indicating severe difficulty.\n“The current distinction between essential and non-essential businesses is only one of many ways in which to deal with public health risk,” said Piet le Roux, chief executive officer at Sakeliga.\nRead: You will now need this new certificate to stay open as an essential service during South Africa’s lockdown", "url": "https://businesstech.co.za/news/business/390355/south-african-businesses-say-that-essential-vs-non-essential-is-not-working-heres-what-to-do-instead/", "rss_link": "http://businesstech.co.za/news/feed/", "title": "South African businesses say that ‘essential vs non-essential’ is not working – here’s what to do instead"}
{"authors": ["Staff Writer"], "publish_date": "nil", "text": "Medical schemes regulator, the Council of Medical Scheme (CMS), is encouraging medical schemes to cover the screening, diagnosis, treatment and care of Covid-19 patients, and to consider giving members a premium holiday for three months where certain conditions are met.\n\nIn a circular sent to schemes on Thursday (16 April) CMS chief executive and registrar, Dr Sipho Kabane, also asked medical schemes to ensure that there was continued compliance with their managed care protocols to mitigate the possible negative impact of Covid-19.\n\nAt the onset of the pandemic, medical schemes were not obliged to pay for Covid-19 tests where members had tested and received a negative result. As a result, most schemes only paid for tests and relevant treatment when members had tested Covid-19 positive.\n\n“The CMS lodged a draft amendment to the Prescribed Minimum Benefit (PMB) regulations with the Minister of Health to cover the screening, diagnosis, treatment and care of Covid-19 as part of the Prescribed Minimum Benefits package,” said Kabane.\n\n“The signing and promulgation of coronavirus in the National Gazette and the publication thereof are being handled by the National Department of Health.”\n\nFinanical support\n\nThe CMS also encouraged medical schemes to assist vulnerable members who cannot pay contributions due to loss of income as a result of the coronavirus pandemic and subsequent lockdown.\n\n“Schemes should investigate all disruptions to member contributions on a case by case basis and determine the merits thereof, before suspension or termination of membership,” said Kabane.\n\nThe CMS said that where a member had accumulated sufficient savings in their Personal Medical Savings Account (PMSA) for a specific period, it would be in the public interest, to grant medical schemes exemptions from complying with their registered rules to use their savings to offset member contributions.\n\nThe regulator said that Small, Medium and Micro-Sized Enterprises (SMMEs), seeking financial relief from medical schemes to protect their employees’ membership cover should make a case to their respective medical scheme, demonstrating the financial impact caused by the lockdown due to the Covid-19 pandemic.\n\nThe CMS said consideration must be given to SMME’s ability to financially recover and to repay the medical scheme post the lockdown period.\n\n“To ensure that medical scheme members have continued access to healthcare services and to prevent the possible exploitation of patients as a result of the COVID-19 pandemic, the CMS is facilitating an Industry-wide engagement to develop a price and tariff negotiations framework,” said Kabane\n\n“In this initiative, the CMS is working with industry associations such as the Board of Healthcare Funders (BHF) and Health Funders Association (HFA), with the support of the National Department of Health. CMS’ role is to ensure that negotiations will benefit all medical scheme members,” he said.\n\nRead: Outsurance announces new relief measures for coronavirus lockdown – including a 15% discount on premiums", "keywords": ["savings", "premium", "south", "cms", "tests", "asked", "month", "cover", "medical", "scheme", "treatment", "result", "holiday", "covid19", "members", "schemes", "pandemic", "coronavirus"], "summary": "Medical schemes regulator, the Council of Medical Scheme (CMS), is encouraging medical schemes to cover the screening, diagnosis, treatment and care of Covid-19 patients, and to consider giving members a premium holiday for three months where certain conditions are met.\nAt the onset of the pandemic, medical schemes were not obliged to pay for Covid-19 tests where members had tested and received a negative result.\nAs a result, most schemes only paid for tests and relevant treatment when members had tested Covid-19 positive.\nThe CMS said consideration must be given to SMME’s ability to financially recover and to repay the medical scheme post the lockdown period.\nCMS’ role is to ensure that negotiations will benefit all medical scheme members,” he said.", "url": "https://businesstech.co.za/news/finance/390379/south-african-medical-aids-asked-to-give-members-a-3-month-premium-holiday-and-cover-coronavirus-tests/", "rss_link": "http://businesstech.co.za/news/feed/", "title": "South African medical aids asked to give members a 3 month premium holiday – and cover coronavirus tests"}
{"authors": ["Staff Writer"], "publish_date": "nil", "text": "Companies, which are registered through the Companies and Intellectual Property Commission’s (CIPC) BizPortal to perform essential services during the lockdown period, will be required to have a new certificate for the extended period, the Department of Trade and Industry has announced.\n\nThe certificate will be sent via email using the details provided at the time of registration, and will also be available for download from Friday (17 April). The full list of registered companies will have received their certificates by the weekend, the DTI said.\n\n“The new certificate will clearly state that it is for the extended lockdown period, beginning 17 April 2020, and South African Police Service officials will be told which certificates to look for.\n\n“Certificates issued before today will no longer be valid and must be disposed of. To provide time for businesses to adjust to the new requirements, the new certificates will be available to be displayed from start of business on Monday (20 April 2020).”\n\nThe department said that possession of the CIPC certificate is still subject to the company fully complying with the applicable lockdown regulations and is a record of the company’s details, and does not in itself constitute the right to continue operating during the period.\n\nOnly businesses which provide essential services in terms of the regulations may continue their operations during the Covid-19 lockdown, it said.\n\nOnly for registered companies\n\nThe certificate is a reference to the legal registration of the company in terms of the Companies Act and a record of registration to the CIPC.\n\nThis means that the registration portal is only for companies registered in terms of the Companies Act, the DTI said.\n\n“Other essential service providers, like healthcare professionals registered with the Health Professions Council of South Africa, sole proprietors who provide essential goods and services (like small business owners and spaza shops), and small-scale farmers will not register through the Bizportal.\n\n“These businesses will not have a CIPC certificate, but must still comply with the provisions of the lockdown regulations,” it said.\n\nWhere the CIPC finds that certificates have been issued to companies which do not meet the definitions of an essential service, such certificate will be revoked, and the company will be referred to the South African Police Services, the DTI said.\n\n“False declaration by the company is a criminal offence and will result in prosecution, in terms of lockdown regulations.”\n\nRead: Fast food and takeaways should be allowed under South Africa’s phased lockdown lifting: association", "keywords": ["service", "lockdown", "south", "essential", "registered", "stay", "certificate", "terms", "companies", "services", "company", "open", "africas", "need", "registration"], "summary": "The full list of registered companies will have received their certificates by the weekend, the DTI said.\nOnly businesses which provide essential services in terms of the regulations may continue their operations during the Covid-19 lockdown, it said.\nThis means that the registration portal is only for companies registered in terms of the Companies Act, the DTI said.\n“These businesses will not have a CIPC certificate, but must still comply with the provisions of the lockdown regulations,” it said.\n“False declaration by the company is a criminal offence and will result in prosecution, in terms of lockdown regulations.”Read: Fast food and takeaways should be allowed under South Africa’s phased lockdown lifting: association", "url": "https://businesstech.co.za/news/business/390319/you-will-now-need-this-new-certificate-to-stay-open-as-an-essential-service-during-south-africas-lockdown/", "rss_link": "http://businesstech.co.za/news/feed/", "title": "You will now need this new certificate to stay open as an essential service during South Africa’s lockdown"}
{"authors": ["Staff Writer"], "publish_date": "nil", "text": "Following the announcement that it will ‘incrementally lift‘ South Africa’s lockdown, the Franchise Association of South Africa (FASA) has asked government to include fast food and takeaways as part of the country’s essential services.\n\nPrior to the lockdown, this sector of the franchise industry had already taken steps to augment their preparation procedures to deliver contactless food orders to their customers, said Vera Valasis, FASA’s executive director.\n\n“While one can understand that government decided to take very strict measures to damp down the spread of the virus, we believe not having an alternative to their need for food, people are being driven out of their homes to buy food so there may be an even greater risk in not allowing contactless food delivery or for so-called dark kitchens to continue offering cooked food to consumers,” she said.\n\n“Delivery services have been operating all along, so allowing them to deliver prepared take-out or fast food in addition to their other essential supply deliveries, makes for good economic sense.\n\n“This would go a long way to minimise job losses and keep the franchise workforce earning much-needed income to support their families.”\n\nValasis also warned that the entire franchise industry will need additional financial relief from government once the lockdown is lifted.\n\nThe industry generates approximately R734 billion to the economy, according to Sanlam’s 2019 Franchise Survey. Approximately 500,000 employees enjoy permanent employment nationwide in its 48,000 franchised outlets and 824 franchise companies – contributing just under 14% to the country’s GDP.\n\n“Since the implementation of the Covid-19 emergency measures, around 94% of the industry has not been trading, with the exception of mostly food retailers,” Valasis said.\n\n“This has had a devastating impact on the industry and it is feared that unless more financial aid is provided some 15% i.e. 75,000 jobs could be lost in the industry.”\n\nRental and financial relief\n\nValasis said that rental relief and loans are mostly offered on a basis of deferment of debt or a payment holiday. She added that once the lockdown has been lifted, it is not expected that business and sales would continue as normal.\n\n“However, once businesses re-open, landlords would most certainly revert to lease agreements that are in place, demand rentals and deferred arrears straightaway as would suppliers and other debtors.\n\n“Small business owners who are indebted by Covid-19 emergency fund loans would not cope under such a huge debt burden and further job losses would most certainly follow.\n\n“Therefore, we urge you to call on the banking industry and others to make meaningful contributions to small business in the form of immediate grant funding to save jobs and keep the economy going.”\n\nOn the other side of the Covid-19 crises, lenders with particular reference to the South African banks should be called upon to agree to soften their very strict lending criteria, said Valasis.\n\nShe said that the country’s banks are notoriously risk-averse and it is difficult for any potential business owners to obtain funding from a bank.\n\n“Should the banks agree to consider business loan applications for franchised outlets on a less-risk averse basis, we believe it could make a material difference in getting people back into business or start new ones quickly thus stimulating employment and economic activity,” she said.\n\nRead: New regulations as South Africa prepares for ‘incremental’ lifting of lockdown", "keywords": ["lockdown", "south", "business", "banks", "allowed", "takeaways", "phased", "industry", "food", "fast", "lifting", "association", "franchise", "financial", "covid19", "africas", "countrys"], "summary": "Following the announcement that it will ‘incrementally lift‘ South Africa’s lockdown, the Franchise Association of South Africa (FASA) has asked government to include fast food and takeaways as part of the country’s essential services.\nPrior to the lockdown, this sector of the franchise industry had already taken steps to augment their preparation procedures to deliver contactless food orders to their customers, said Vera Valasis, FASA’s executive director.\nShe added that once the lockdown has been lifted, it is not expected that business and sales would continue as normal.\nShe said that the country’s banks are notoriously risk-averse and it is difficult for any potential business owners to obtain funding from a bank.\nRead: New regulations as South Africa prepares for ‘incremental’ lifting of lockdown", "url": "https://businesstech.co.za/news/business/390287/fast-food-and-takeaways-should-be-allowed-under-south-africas-phased-lockdown-lifting-association/", "rss_link": "http://businesstech.co.za/news/feed/", "title": "Fast food and takeaways should be allowed under South Africa’s phased lockdown lifting: association"}